; domain
;; Warehouse: a forklift moves pallets between bays and manages its own charge.
;;
;; The charge is symbolic, not numeric: the levels are objects, and (next ?above
;; ?below) in the problem file says which level follows which. Driving steps the
;; charge down one level and charging steps it up one, so a forklift at the
;; bottom level has no (next) fact to match and cannot drive at all.

(define (domain warehouse)
  (:requirements :strips :typing)

  (:types forklift pallet bay level - object)

  (:predicates
    (at ?f - forklift ?b - bay)          ; where the forklift is
    (pallet-at ?p - pallet ?b - bay)     ; where a pallet is resting
    (carrying ?f - forklift ?p - pallet) ; forklift is holding this pallet
    (free ?f - forklift)                 ; forks are empty
    (connected ?from - bay ?to - bay)    ; an aisle, in this direction
    (charger ?b - bay)                   ; this bay has a charging point
    (charge ?f - forklift ?l - level)    ; current charge level
    (next ?above - level ?below - level)); ?below is one step under ?above

  (:action drive
    :parameters (?f - forklift ?from - bay ?to - bay ?l1 - level ?l2 - level)
    :precondition (and (at ?f ?from)
                       (connected ?from ?to)
                       (charge ?f ?l1)
                       (next ?l1 ?l2))
    :effect (and (not (at ?f ?from))
                 (at ?f ?to)
                 (not (charge ?f ?l1))
                 (charge ?f ?l2)))

  (:action pick-up
    :parameters (?f - forklift ?p - pallet ?b - bay)
    :precondition (and (at ?f ?b) (pallet-at ?p ?b) (free ?f))
    :effect (and (not (pallet-at ?p ?b))
                 (carrying ?f ?p)
                 (not (free ?f))))

  (:action put-down
    :parameters (?f - forklift ?p - pallet ?b - bay)
    :precondition (and (at ?f ?b) (carrying ?f ?p))
    :effect (and (pallet-at ?p ?b)
                 (not (carrying ?f ?p))
                 (free ?f)))

  (:action recharge
    :parameters (?f - forklift ?b - bay ?l1 - level ?l2 - level)
    :precondition (and (at ?f ?b) (charger ?b) (charge ?f ?l1) (next ?l2 ?l1))
    :effect (and (not (charge ?f ?l1))
                 (charge ?f ?l2))))

; problem
;; The reference instance, at the scale floor the question asks for: five pallets,
;; two forklifts, four bays, and two charging points. goods-in and dock are two
;; aisles apart and only they have chargers, so a full charge of three drives
;; covers a delivery but not the return trip, and no run of this instance is
;; free of recharging. Fast Downward's plan uses seven recharge actions.

(define (problem warehouse-shift)
  (:domain warehouse)

  (:objects
    fork1 fork2                    - forklift
    pal1 pal2 pal3 pal4 pal5       - pallet
    goods-in aisle-a aisle-b dock  - bay
    full half low empty            - level)

  (:init
    (next full half) (next half low) (next low empty)

    (charger goods-in) (charger dock)

    (connected goods-in aisle-a) (connected aisle-a goods-in)
    (connected aisle-a dock)     (connected dock aisle-a)
    (connected goods-in aisle-b) (connected aisle-b goods-in)
    (connected aisle-b dock)     (connected dock aisle-b)

    (at fork1 goods-in) (charge fork1 full) (free fork1)
    (at fork2 dock)     (charge fork2 full) (free fork2)

    (pallet-at pal1 goods-in)
    (pallet-at pal2 goods-in)
    (pallet-at pal3 goods-in)
    (pallet-at pal4 aisle-a)
    (pallet-at pal5 dock))

  (:goal (and
    (pallet-at pal1 dock)
    (pallet-at pal2 dock)
    (pallet-at pal3 dock)
    (pallet-at pal4 dock)
    (pallet-at pal5 goods-in))))

; plan
1. (drive fork2 dock aisle-a full half)
   deleted: (at fork2 dock) (charge fork2 full)
   added: (at fork2 aisle-a) (charge fork2 half)
   goals met: 0 of 5
2. (pick-up fork2 pal4 aisle-a)
   deleted: (pallet-at pal4 aisle-a) (free fork2)
   added: (carrying fork2 pal4)
   goals met: 0 of 5
3. (drive fork2 aisle-a dock half low)
   deleted: (at fork2 aisle-a) (charge fork2 half)
   added: (at fork2 dock) (charge fork2 low)
   goals met: 0 of 5
4. (put-down fork2 pal4 dock)
   deleted: (carrying fork2 pal4)
   added: (pallet-at pal4 dock) (free fork2)
   goals met: 1 of 5
5. (drive fork2 dock aisle-b low empty)
   deleted: (at fork2 dock) (charge fork2 low)
   added: (at fork2 aisle-b) (charge fork2 empty)
   goals met: 1 of 5
6. (pick-up fork1 pal1 goods-in)
   deleted: (pallet-at pal1 goods-in) (free fork1)
   added: (carrying fork1 pal1)
   goals met: 1 of 5
7. (drive fork1 goods-in aisle-b full half)
   deleted: (at fork1 goods-in) (charge fork1 full)
   added: (at fork1 aisle-b) (charge fork1 half)
   goals met: 1 of 5
8. (drive fork1 aisle-b dock half low)
   deleted: (at fork1 aisle-b) (charge fork1 half)
   added: (at fork1 dock) (charge fork1 low)
   goals met: 1 of 5
9. (put-down fork1 pal1 dock)
   deleted: (carrying fork1 pal1)
   added: (pallet-at pal1 dock) (free fork1)
   goals met: 2 of 5
10. (recharge fork1 dock low half)
   deleted: (charge fork1 low)
   added: (charge fork1 half)
   goals met: 2 of 5
11. (pick-up fork1 pal5 dock)
   deleted: (pallet-at pal5 dock) (free fork1)
   added: (carrying fork1 pal5)
   goals met: 2 of 5
12. (drive fork1 dock aisle-b half low)
   deleted: (at fork1 dock) (charge fork1 half)
   added: (at fork1 aisle-b) (charge fork1 low)
   goals met: 2 of 5
13. (drive fork1 aisle-b goods-in low empty)
   deleted: (at fork1 aisle-b) (charge fork1 low)
   added: (at fork1 goods-in) (charge fork1 empty)
   goals met: 2 of 5
14. (recharge fork1 goods-in empty low)
   deleted: (charge fork1 empty)
   added: (charge fork1 low)
   goals met: 2 of 5
15. (put-down fork1 pal5 goods-in)
   deleted: (carrying fork1 pal5)
   added: (pallet-at pal5 goods-in) (free fork1)
   goals met: 3 of 5
16. (recharge fork1 goods-in low half)
   deleted: (charge fork1 low)
   added: (charge fork1 half)
   goals met: 3 of 5
17. (pick-up fork1 pal2 goods-in)
   deleted: (pallet-at pal2 goods-in) (free fork1)
   added: (carrying fork1 pal2)
   goals met: 3 of 5
18. (drive fork1 goods-in aisle-b half low)
   deleted: (at fork1 goods-in) (charge fork1 half)
   added: (at fork1 aisle-b) (charge fork1 low)
   goals met: 3 of 5
19. (drive fork1 aisle-b dock low empty)
   deleted: (at fork1 aisle-b) (charge fork1 low)
   added: (at fork1 dock) (charge fork1 empty)
   goals met: 3 of 5
20. (recharge fork1 dock empty low)
   deleted: (charge fork1 empty)
   added: (charge fork1 low)
   goals met: 3 of 5
21. (put-down fork1 pal2 dock)
   deleted: (carrying fork1 pal2)
   added: (pallet-at pal2 dock) (free fork1)
   goals met: 4 of 5
22. (recharge fork1 dock low half)
   deleted: (charge fork1 low)
   added: (charge fork1 half)
   goals met: 4 of 5
23. (drive fork1 dock aisle-b half low)
   deleted: (at fork1 dock) (charge fork1 half)
   added: (at fork1 aisle-b) (charge fork1 low)
   goals met: 4 of 5
24. (drive fork1 aisle-b goods-in low empty)
   deleted: (at fork1 aisle-b) (charge fork1 low)
   added: (at fork1 goods-in) (charge fork1 empty)
   goals met: 4 of 5
25. (recharge fork1 goods-in empty low)
   deleted: (charge fork1 empty)
   added: (charge fork1 low)
   goals met: 4 of 5
26. (pick-up fork1 pal3 goods-in)
   deleted: (pallet-at pal3 goods-in) (free fork1)
   added: (carrying fork1 pal3)
   goals met: 4 of 5
27. (recharge fork1 goods-in low half)
   deleted: (charge fork1 low)
   added: (charge fork1 half)
   goals met: 4 of 5
28. (drive fork1 goods-in aisle-b half low)
   deleted: (at fork1 goods-in) (charge fork1 half)
   added: (at fork1 aisle-b) (charge fork1 low)
   goals met: 4 of 5
29. (drive fork1 aisle-b dock low empty)
   deleted: (at fork1 aisle-b) (charge fork1 low)
   added: (at fork1 dock) (charge fork1 empty)
   goals met: 4 of 5
30. (put-down fork1 pal3 dock)
   deleted: (carrying fork1 pal3)
   added: (pallet-at pal3 dock) (free fork1)
   goals met: 5 of 5
